---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectShapeLibrary
source: html/9a8aab78-b772-d2ad-3584-8bec27ad3132.htm
---
# DirectShapeLibrary Properties

Specifies whether the .NET object represents a valid Revit entity.